spec/spec/SVWS/IntegrationPlatform/Examples/PaymentToServiceProviderRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://sv.bpc.in/SVIP">
    <soapenv:Header/>
    <soapenv:Body>
    <int:IFX>
        <PmtAddRq>
            <RqUID>3127a63b-d8f1-4bed-94ad-d96ffd321a86</RqUID>
            <MsgRqHdr>
                <ContextRqHdr>
                    <NetworkTrnData>
                        <NetworkOwner>Branch</NetworkOwner>
                        <TerminalIdent>10000073</TerminalIdent>
                    </NetworkTrnData>
                    <ClientDt>2011-08-08T12:45:45</ClientDt>
                </ContextRqHdr>
            </MsgRqHdr>
            <PmtInfo>
                <CurAmt>
                    <Amt>12345</Amt>
                    <CurCode>
                        <CurCodeValue>RUB</CurCodeValue>
                    </CurCode>
                </CurAmt>
                <CPPData>
                    <OrgData>
                        <OrgName>
                            <Name>MTS</Name>
                        </OrgName>
                    </OrgData>
                </CPPData>
                <DebtorData>
                    <PersonData>
                        <IssuedIdent>
                            <IssuedIdentType>PrtryId</IssuedIdentType>
                            <IssuedIdentValue>9169169610</IssuedIdentValue>
                        </IssuedIdent>
                    </PersonData>
                </DebtorData>
                <PmtInstruction>
                    <PmtMethod>DebitNetwork</PmtMethod>
                    <FromAcctRef>
                        <AcctKeys>
                            <AcctIdent>
                            <AcctIdentType>AcctNum</AcctIdentType>
                            <AcctIdentValue>40817810020000127849</AcctIdentValue>
                            </AcctIdent>
                        </AcctKeys>
                    </FromAcctRef>
                    <Memo>Mobile phone payment</Memo>
                </PmtInstruction>
                <PrcDt>2012-02-01</PrcDt>
            </PmtInfo>
        </PmtAddRq>
    </int:IFX>
    </soapenv:Body>
</soapenv:Envelope>